The example repo was newly created, before trying to apply above change. The apply output:

```
Initializing the backend...
Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/vault versions matching "~> 5.7.0"...
- Finding integrations/github versions matching "~> 6.11.0"...
- Installing hashicorp/vault v5.7.0...
- Installed hashicorp/vault v5.7.0 (signed by HashiCorp)
- Installing integrations/github v6.11.0...
- Installed integrations/github v6.11.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

<-- snip -->

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # github_repository.repositories will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + allow_update_branch                     = true
      + archived                                = false
      + auto_init                               = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "andries-playground2"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = (known after apply)
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false
        # (1 unchanged attribute hidden)
      + security_and_analysis (known after apply)
    }
```

Forking is disabled on a organisation level. 